zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_INTC.h
#define INTC_IPR10_FTFL_CC_MASK                  (0x3U)
#define INTC_IPR10_FTFL_CC_SHIFT                 (0U)
/*! FTFL_CC - FTFL Command Complete Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_FTFL_CC(x)                    (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_FTFL_CC_SHIFT)) & INTC_IPR10_FTFL_CC_MASK)

#define INTC_IPR10_CMPD_MASK                     (0xCU)
#define INTC_IPR10_CMPD_SHIFT                    (2U)
/*! CMPD - Comparator D Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_CMPD(x)                       (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_CMPD_SHIFT)) & INTC_IPR10_CMPD_MASK)

#define INTC_IPR10_CMPC_MASK                     (0x30U)
#define INTC_IPR10_CMPC_SHIFT                    (4U)
/*! CMPC - Comparator C Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_CMPC(x)                       (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_CMPC_SHIFT)) & INTC_IPR10_CMPC_MASK)

#define INTC_IPR10_CMPB_MASK                     (0xC0U)
#define INTC_IPR10_CMPB_SHIFT                    (6U)
/*! CMPB - Comparator B Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_CMPB(x)                       (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_CMPB_SHIFT)) & INTC_IPR10_CMPB_MASK)

#define INTC_IPR10_CMPA_MASK                     (0x300U)
#define INTC_IPR10_CMPA_SHIFT                    (8U)
/*! CMPA - Comparator A Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_CMPA(x)                       (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_CMPA_SHIFT)) & INTC_IPR10_CMPA_MASK)

#define INTC_IPR10_PIT1_ROLLOVR_MASK             (0xC00U)
#define INTC_IPR10_PIT1_ROLLOVR_SHIFT            (10U)
/*! PIT1_ROLLOVR - PIT1 Roll Over Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_PIT1_ROLLOVR(x)               (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_PIT1_ROLLOVR_SHIFT)) & INTC_IPR10_PIT1_ROLLOVR_MASK)

#define INTC_IPR10_PIT0_ROLLOVR_MASK             (0x3000U)
#define INTC_IPR10_PIT0_ROLLOVR_SHIFT            (12U)
/*! PIT0_ROLLOVR - PIT0 Roll Over Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_PIT0_ROLLOVR(x)               (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_PIT0_ROLLOVR_SHIFT)) & INTC_IPR10_PIT0_ROLLOVR_MASK)

#define INTC_IPR10_PDB1_MASK                     (0xC000U)
#define INTC_IPR10_PDB1_SHIFT                    (14U)
/*! PDB1 - PDB1 Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR10_PDB1(x)                       (((uint16_t)(((uint16_t)(x)) << INTC_IPR10_PDB1_SHIFT)) & INTC_IPR10_PDB1_MASK)
/*! @} */

/*! @name IPR11 - Interrupt Priority Register 11 */
/*! @{ */

#define INTC_IPR11_PDB0_MASK                     (0x3U)
#define INTC_IPR11_PDB0_SHIFT                    (0U)
/*! PDB0 - PDB0 Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR11_PDB0(x)                       (((uint16_t)(((uint16_t)(x)) << INTC_IPR11_PDB0_SHIFT)) & INTC_IPR11_PDB0_MASK)

#define INTC_IPR11_ENC_INDEX_MASK                (0xCU)
#define INTC_IPR11_ENC_INDEX_SHIFT               (2U)
/*! ENC_INDEX - Quad Decoder Index Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR11_ENC_INDEX(x)                  (((uint16_t)(((uint16_t)(x)) << INTC_IPR11_ENC_INDEX_SHIFT)) & INTC_IPR11_ENC_INDEX_MASK)

#define INTC_IPR11_ENC_HOME_DOG_MASK             (0x30U)
#define INTC_IPR11_ENC_HOME_DOG_SHIFT            (4U)
/*! ENC_HOME_DOG - Quad Decoder Home/Watchdog Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR11_ENC_HOME_DOG(x)               (((uint16_t)(((uint16_t)(x)) << INTC_IPR11_ENC_HOME_DOG_SHIFT)) & INTC_IPR11_ENC_HOME_DOG_MASK)

#define INTC_IPR11_ENC_COMPARE_MASK              (0xC0U)
#define INTC_IPR11_ENC_COMPARE_SHIFT             (6U)
/*! ENC_COMPARE - Quad Decoder Compare Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR11_ENC_COMPARE(x)                (((uint16_t)(((uint16_t)(x)) << INTC_IPR11_ENC_COMPARE_SHIFT)) & INTC_IPR11_ENC_COMPARE_MASK)

#define INTC_IPR11_GPIOG_MASK                    (0x300U)
#define INTC_IPR11_GPIOG_SHIFT                   (8U)
/*! GPIOG - GPIO G Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR11_GPIOG(x)                      (((uint16_t)(((uint16_t)(x)) << INTC_IPR11_GPIOG_SHIFT)) & INTC_IPR11_GPIOG_MASK)

#define INTC_IPR11_GPIOF_MASK                    (0xC00U)
#define INTC_IPR11_GPIOF_SHIFT                   (10U)
/*! GPIOF - GPIO F Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR11_GPIOF(x)                      (((uint16_t)(((uint16_t)(x)) << INTC_IPR11_GPIOF_SHIFT)) & INTC_IPR11_GPIOF_MASK)

#define INTC_IPR11_GPIOE_MASK                    (0x3000U)
#define INTC_IPR11_GPIOE_SHIFT                   (12U)
/*! GPIOE - GPIO E Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 0
 *  0b10..IRQ Priority Level 1
 *  0b11..IRQ Priority Level 2
 */
#define INTC_IPR11_GPIOE(x)                      (((uint16_t)(((uint16_t)(x)) << INTC_IPR11_GPIOE_SHIFT)) & INTC_IPR11_GPIOE_MASK)

